Language = {}

Language.translate = {
    ['en'] = {
        ['press'] = '按[ENTER]开始工作',
        ['nojob'] = '干得不错',
        ['gopos'] = '前往标记区域',
        ['pressc'] = '按[ENTER]装满桶',
        ['goto'] = '前往下一个标记区域',
        ['carry'] = '将所有材料装入车中',
        ['completejob'] = '你已完成工作，你获胜了',
        ['noveh'] = '你必须用车将所有设备交付',
        ['temp'] = '计时器：',
        ['seconds'] = ' 剩余秒数',
        ['lose'] = '你没有按时到达，任务已取消',
        ['pressf'] = '按[ENTER]连接油管',
        ['mining'] = '装满桶',
        ['placing'] = '装载车辆',

    },
    ['ar'] = {
        ['press'] = 'ﻞﻤﻌﻟﺍﺀﺪﺒﻟ [ENTER] ﻂﻐﺿﺍ',
        ['nojob'] = 'ﻋﻤﻞ ﺟﻴﺪ',
        ['gopos'] = 'ﺍﻧﺘﻘﻞ ﺇﻟﻰ ﺍﻟﻤﻮﻗﻒ ﺍﻟﻤﺤﺪﺩ',
        ['pressc'] = 'ﺏﺮﻌﻟﺍ ﻞﻴﻤﺤﺘﻟ [ENTER] ﻂﻐﺿﺍ',
        ['goto'] = 'ﺍﺫﻫﺐ ﺇﻟﻰ ﺍﻟﻤﻮﻗﻊ ﺍﻟﺘﺎﻟﻲ',
        ['carry'] = 'ﻗﻢ ﺑﺘﺤﻤﻴﻞ ﺟﻤﻴﻊ ﺍﻟﻤﻮﺍﺩ  ﻓﻲ ﺍﻟﻌﺮﺏ',
        ['completejob'] = 'ﻟﻘﺪ ﺃﻛﻤﻠﺖ ﻋﻤﻠﻚ ، ﻟﻘﺪ ﺭﺑﺤﺖ',
        ['noveh'] = 'ﻳﺠﺐ ﻋﻠﻴﻚ ﺗﺴﻠﻴﻢ ﺟﻤﻴﻊ ﺍﻟﻤﻮﺍﺩ ﻣﻊ ﺍﻟﻌﺮﺏ ',
        ['temp'] = ' ﺖﻴﻗﻮﺗ:',
        ['seconds'] = ' ﺔﻴﻘﺒﺘﻤﻟﺍ ﻲﻧﺍﻮﺜﻟﺍ',
        ['lose'] = 'ﻟﻢ ﺗﺼﻞ ﻓﻲ ﺍﻟﻮﻗﺖ ﺍﻟﻤﺤﺪﺩ ، ﺗﻢ ﺇﻟﻐﺎﺀ ﺍﻟﻮﻇﻴﻔﺔ',
        ['pressf'] = 'ﻂﻔﻨﻟﺍ ﻞﻴﺻﻮﺘﻟ [ENTER] ﻂﻐﺿﺍ',
        ['mining'] = 'ﺩﻟﻮ ﻣﻤﺘﻠﺊ',
        ['placing'] = 'ﺏﻣﻼﺀ ﺍﻟﻌﺮﺏ'

    }
}
